Tobamalau/nrf52840/nRF5_SDK_for_Thread_and_Zigbee_v3.2.0_9fade31/examples/thread/cli/main.c
/**
 * Copyright (c) 2017 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup cli_example_main main.c
 * @{
 * @ingroup cli_example
 * @brief An example presenting OpenThread CLI.
 *
 */

#include "app_scheduler.h"
#include "app_timer.h"
#include "bsp_thread.h"
#include "nrf_log_ctrl.h"
#include "nrf_log.h"
#include "nrf_log_default_backends.h"

#include "thread_utils.h"
#include "youtube48_8_vbr.c"

#include <openthread/thread.h>

#define SCHED_QUEUE_SIZE      32                              /**< Maximum number of events in the scheduler queue. */
#define SCHED_EVENT_DATA_SIZE APP_TIMER_SCHED_EVENT_DATA_SIZE /**< Maximum app_scheduler event size. */

#define THREAD_CONFIG 1
static const unsigned char UDP_PAYLOAD[]   = "Hello New World!";
static const unsigned char UDP_REQUEST[]   = "r";
unsigned char audioPaket[104];

int16_t Nbbytescnt = sizeof(NBbytes) / sizeof(NBbytes[0]);
int16_t sendLoopCnt = 0;
uint32_t Nbbytessum = 0;


void handleUdpReceive(void *aContext, otMessage *aMessage, 
                      const otMessageInfo *aMessageInfo);
/***************************************************************************************************
 * @section Callbacks
 **************************************************************************************************/

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
    switch (event)
    {
        case BSP_EVENT_KEY_0:    //sende Hallo Welt
            NRF_LOG_INFO("Button 1 pressed");
            sendUdp(thread_ot_instance_get(), UDP_PAYLOAD, sizeof(UDP_PAYLOAD));            
            break;

        case BSP_EVENT_KEY_1:    //sende 104 Byte Payload
            NRF_LOG_INFO("Button 2 pressed");
            sendUdp(thread_ot_instance_get(), opusData, 104);
            break;

        case BSP_EVENT_KEY_2:
            NRF_LOG_INFO("Button 3 (UDP_REQUEST) pressed");
            sendUdp(thread_ot_instance_get(), UDP_REQUEST, sizeof(UDP_REQUEST));
            break;

        case BSP_EVENT_KEY_3:
            NRF_LOG_INFO("Button 4 (send all) pressed");
            int16_t nbbytescnt = 0;
            uint32_t nbbytessum = 0;
            const unsigned char *input = opusData;
            
            for(int i = 0; i<nbbytescnt; i++)
            {
               audioPaket[1]= nbbytescnt;

              sendUdp(thread_ot_instance_get(), audioPaket, sizeof(audioPaket));
              /*while(!otLinkIsInTransmitState(thread_ot_instance_get())){
                  NRF_LOG_INFO("otLinkIsInTransmitState");
                  __WFE();
              }*/
              nbbytessum += NBbytes[i];
              input = opusData + nbbytessum;
            }
            //NRF_LOG_INFO("%d mal UDP send", i);
            break;

          default:
            break;
    }
}

void handleUdpReceive(void *aContext, otMessage *aMessage,
                      const otMessageInfo *aMessageInfo)
{
    char messageBuffer[otMessageGetLength(aMessage)];

    OT_UNUSED_VARIABLE(aContext);
    OT_UNUSED_VARIABLE(aMessageInfo);
    otMessageRead(aMessage, otMessageGetOffset(aMessage), messageBuffer, otMessageGetLength(aMessage));
    NRF_LOG_INFO("UDP Message recived:%s", messageBuffer);
    bsp_board_led_invert(1);
    if(messageBuffer[0] == 0x72)// && otMessageGetLength(aMessage) == 1)
    {
      const unsigned char *input;
      if(sendLoopCnt>=Nbbytescnt)
        sendLoopCnt = 0;

      input = opusData + Nbbytessum;
      sendUdp(thread_ot_instance_get(), input, NBbytes[sendLoopCnt]);
      Nbbytessum += NBbytes[sendLoopCnt];
      sendLoopCnt++;     
    }   
}

/***************************************************************************************************
 * @section State
 **************************************************************************************************/

static void thread_state_changed_callback(uint32_t flags, void * p_context)
{
    NRF_LOG_INFO("State changed! Flags: 0x%08x Current role: %d\r\n",
                 flags, otThreadGetDeviceRole(p_context));
}

/***************************************************************************************************
 * @section Initialization
 **************************************************************************************************/

/**@brief Function for initializing the Application Timer Module.
 */
static void timer_init(void)
{
    uint32_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the LEDs.
 */
static void leds_init(void)
{
    LEDS_CONFIGURE(LEDS_MASK);
    LEDS_OFF(LEDS_MASK);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/*@brief Function for initializing the Thread Stack.*/
 
static void thread_instance_init(void)
{
    thread_configuration_t thread_configuration =
    {
        .radio_mode        = THREAD_RADIO_MODE_RX_ON_WHEN_IDLE,
        .autocommissioning = true,
        .autostart_disable = false,
    };

    thread_init(&thread_configuration);
    thread_cli_init();                //wie im openthread Beispiel ruft dann otCliUartInit(instance) auf
    thread_state_changed_callback_set(thread_state_changed_callback); //wie im openthread Beispiel
    //hier im openthread kommt noch setNetworkConfiguration() wo PanID und Masterkey definbiert wurde
    uint32_t err_code = bsp_thread_init(thread_ot_instance_get()); //otSetStateChangedCallback(), otIcmp6RegisterHandler()
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for deinitializing the Thread Stack.
 *
 */
static void thread_instance_finalize(void)
{
    bsp_thread_deinit(thread_ot_instance_get());
    thread_soft_deinit();
}


/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/***************************************************************************************************
 * @section Main
 **************************************************************************************************/

int main(int argc, char *argv[])
{
#if 1
    log_init();
    scheduler_init();
    timer_init();
    leds_init();

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

   audioPaket[0]= 0xff;
   audioPaket[2]= 0x64;
   audioPaket[3]= 0x00;
   for(int i=3; i<sizeof(audioPaket);i++)
      audioPaket[i]= i;


#endif    

    while (true)
    {
#if THREAD_CONFIG
    thread_init_Tobi(thread_state_changed_callback);
    initUdp(thread_ot_instance_get(), handleUdpReceive);
#else
    thread_instance_init();
    //initUdp(thread_ot_instance_get());
#endif

        
        

        while (!thread_soft_reset_was_requested())
        {
#if 1
            thread_process();
#endif
            app_sched_execute();

            if (NRF_LOG_PROCESS() == false)
            {
                thread_sleep();
            }
        }

        thread_instance_finalize();
    }
}
